# === Homebrew Taps ===
# (Fonts are now in core Homebrew - no tap needed)

# === Shell & Terminal Utilities ===
brew 'zsh-syntax-highlighting'
brew 'bash'                # Latest Bash version
brew 'coreutils'           # GNU core utilities, newer than macOS default
brew 'grep'
brew 'tree'
brew 'htop'
brew 'btop'                # Modern system monitor (better than htop)
brew 'nmap'
brew 'wget'
cask 'mitmproxy'

# === Modern CLI Tools ===
brew 'eza'                 # Modern ls replacement (colorful, git-aware)
brew 'bat'                 # cat with syntax highlighting
brew 'ripgrep'             # Faster grep (rg command)
brew 'fd'                  # Faster, user-friendly find
brew 'fzf'                 # Fuzzy finder (essential productivity tool)
brew 'zoxide'              # Smarter cd (tracks frecency)
brew 'delta'               # Better git diff viewer
brew 'httpie'              # Better curl for APIs (http command)
brew 'glow'                # Markdown renderer for terminal
brew 'direnv'              # Auto-load environment variables per directory

# === Secrets & Encryption ===
brew 'pass'
brew 'gpg'
brew 'gnupg'
brew 'git-crypt'

# === Networking / Certs ===
brew 'mkcert'              # Locally trusted development certificates
brew 'nss'                 # Needed for Firefox with mkcert
brew 'wifi-password'       # Quickly retrieve saved Wi-Fi passwords

# === Dev Tools: Git & VCS ===
brew 'git'
brew 'subversion'                 # Required by some font installers
brew 'jq'                  # JSON processor

# === Cloud CLI Tools ===
brew 'awscli'
# brew 'aws-okta'            # AWS + Okta SSO integration
brew 'azure-cli'
# brew 'minio' 
# brew 'minio-mc'
cask 'orbstack'            # Lightweight Docker Desktop replacement
brew 'kubectl'             # K8s CLI
brew 'kubectx'             # Switch between K8s contexts/namespaces easily
brew 'k9s'                 # Kubernetes TUI (better than kubectl alone)
brew 'stern'               # Multi-pod log tailing for K8s
brew 'helm'                # Kubernetes package manager
brew 'kustomize'           # Kubernetes config management
brew 'lazydocker'          # Terminal UI for Docker

# === Terraform & IaC Toolchain ===
brew 'tfenv'               # Terraform version manager
brew 'tfsec'               # Security scanner for Terraform
brew 'checkov'             # IaC static analysis
brew 'tflint'              # Terraform linter
brew 'infracost'           # Cost estimation for Terraform plans
brew 'terrascan'           # Policy as code & security scanning
brew 'graphviz'            # Used with terraform graph
brew 'terraform-docs'      # Generate Terraform modules documentation in various formats

# Optional Terraform Tools
# brew 'blast-radius'      # Visualize Terraform graphs (interactive)
# brew 'sops'              # Secrets management
# brew 'age'               # Modern encryption tool for use with sops

# === Programming Languages & Build Tools ===
brew 'go'
brew 'rustup'
brew 'uv'                  # Python package manager (faster than pip)
brew 'ruff'                # Fast Python linter/formatter (replaces black+flake8+isort)
brew 'pipx'                # Install Python CLI tools in isolated environments
# brew 'gradle'
# brew 'maven'
# brew 'volta'               # JavaScript Tool Manager
brew 'mise'                 # polygot version manager for python, node, java
brew 'lazygit'             # Terminal UI for git

# cask 'openjdk@21'          # Java JDK 21 via Cask

# Database
brew 'duckdb'
brew 'sqlite'

# === Media / Misc ===
brew 'ffmpeg'
brew 'caddy'               # HTTP server with automatic HTTPS

# === Fonts ===
cask 'font-jetbrains-mono'       # Your VS Code font (with ligatures)
cask 'font-fira-code'            # Popular coding font with ligatures
cask 'font-monaspace'            # GitHub's modern monospace font family
cask 'font-hack'                 # Fallback font in your VS Code config

# AI
cask 'claude-code'
