# === Homebrew Taps ===
# (Add taps here if needed in future, e.g., for fonts or alternate repositories)

# === Shell & Terminal Utilities ===
brew 'zsh-syntax-highlighting'
brew 'bash'                # Latest Bash version
brew 'coreutils'           # GNU core utilities, newer than macOS default
brew 'grep'
brew 'tree'
brew 'htop'
brew 'nmap'
brew 'wget'
cask 'mitmproxy'

# === Secrets & Encryption ===
brew 'pass'
brew 'gpg'
brew 'gnupg'
brew 'git-crypt'

# === Networking / Certs ===
brew 'mkcert'              # Locally trusted development certificates
brew 'nss'                 # Needed for Firefox with mkcert
brew 'wifi-password'       # Quickly retrieve saved Wi-Fi passwords

# === Dev Tools: Git & VCS ===
brew 'git'
brew 'svn'                 # Required by some font installers
brew 'jq'                  # JSON processor

# === Cloud CLI Tools ===
brew 'awscli'
# brew 'aws-okta'            # AWS + Okta SSO integration
brew 'azure-cli'
cask 'orbstack'            # Lightweight Docker Desktop replacement
brew 'kubectl'             # K8s CLI
brew 'kubectx'             # Switch between K8s contexts/namespaces easily

# === Terraform & IaC Toolchain ===
brew 'tfenv'               # Terraform version manager
brew 'tfsec'               # Security scanner for Terraform
brew 'checkov'             # IaC static analysis
brew 'tflint'              # Terraform linter
brew 'infracost'           # Cost estimation for Terraform plans
brew 'terrascan'           # Policy as code & security scanning
brew 'graphviz'            # Used with terraform graph
brew 'terraform-docs'      # Generate Terraform modules documentation in various formats

# Optional Terraform Tools
# brew 'blast-radius'      # Visualize Terraform graphs (interactive)
# brew 'sops'              # Secrets management
# brew 'age'               # Modern encryption tool for use with sops

# === Programming Languages & Build Tools ===
brew 'go'
brew 'rustup-init'
brew 'uv'                  # Python package manager (faster than pip)
brew 'jenv'                # Java version manager
brew 'gradle'
brew 'maven'
brew 'volta'               # JavaScript Tool Manager

# cask 'openjdk@21'          # Java JDK 21 via Cask

# === Media / Misc ===
brew 'ffmpeg'
brew 'caddy'               # HTTP server with automatic HTTPS
