# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'clojure/tools'
tap 'heroku/brew'


# Utilities
brew 'zsh-syntax-highlighting'
brew 'jq'
brew 'tree' 
brew 'wifi-password'
cask 'ngrok' 
brew 'heroku'
brew 'pass'
brew 'gpg'
brew 'git-crypt'

# cloud-ops

# Terraform version manager
brew 'tfenv'

# AWS CLI
brew 'awscli'
brew 'aws-okta'
brew 'azure-cli'

# The Kubernetes command-line tool, kubectl, 
# allows you to run commands against Kubernetes clusters
brew 'kubectl'
brew 'kubectx'

# cask 'docker' # This will install Docker & Docker Desktop
brew 'hyperkit'
brew 'docker' # This will install docker cli alone
brew 'minikube'
brew 'docker-compose'
brew 'podman'

# local kubernates dev
brew 'kind'

# Binaries
brew 'git'
brew 'htop'
brew 'nmap'
brew 'wget'
brew 'mitmproxy'
brew 'caddy'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gnupg'
brew 'grep'
brew 'svn' # to install fonts
brew 'mkcert'
brew 'nss' # for firefox

# Development
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'go'
brew 'elixir'
brew 'rustup-init'

cask 'adoptopenjdk'
brew 'jenv'
brew 'gradle'

# Apps
cask 'caffeine'
cask 'visual-studio-code'
cask 'qlmarkdown'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# conferencing
# cask 'zoom'
